gitConverter/src/Documents/Задачи/Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Задачи</name>
  <attributes>
    <name>КодТрекера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодФС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Постановщик</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>План</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Факт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадачаПредшественник</name>
    <type>
      <types>DocumentRef.Задачи</types>
    </type>
  </attributes>
</mdclass:Document>

gitConverter/src/Documents/Задачи/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Дата = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РекурсивноПересчитатьЗадачи(ТекущийОбъект.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИсполнительПриИзменении(Элемент)
	
	Объект.ЗадачаПредшественник = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ДлительностьПриИзменении(Элемент)
	РасчитатьДаты();
КонецПроцедуры

&НаКлиенте
Процедура ФактПриИзменении(Элемент)
	
	Если Объект.Факт > Объект.Длительность Тогда
	
		Объект.Длительность = Объект.Факт;
	
	КонецЕсли;
	
	РасчитатьДаты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадачаПредшественникПриИзменении(Элемент)
	РасчитатьДаты();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура РасчитатьДаты()
	
	Общий.РасчитатьДаты(Объект.ДатаНачала, Объект.ДатаОкончания, Объект.Длительность, Объект.ЗадачаПредшественник)
	
КонецПроцедуры

Процедура РекурсивноПересчитатьЗадачи(ТекущаяЗадача)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Задачи.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.Задачи КАК Задачи
		|ГДЕ
		|	Задачи.ЗадачаПредшественник = &ЗадачаПредшественник";
	
	Запрос.УстановитьПараметр("ЗадачаПредшественник", ТекущаяЗадача);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		Общий.РасчитатьДаты(ЗадачаОбъект.ДатаНачала, ЗадачаОбъект.ДатаОкончания, ЗадачаОбъект.Длительность, ЗадачаОбъект.ЗадачаПредшественник);
		
		ЗадачаОбъект.Записать();
		
		РекурсивноПересчитатьЗадачи(ЗадачаОбъект.Ссылка);
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти
